#/==========================================================================/#
#/      получим код Хэмминга (7,4) и проверим ввод на наличие ошибок        /#
#/==========================================================================/#
message = input("Введите классический код Хэмминга (7,4): ")
if len(message) != 7 or set(message) not in [{'0','1'}, {'1'}, {'0'}]:
    raise ValueError('Код должен состоять ровно из 7 цифр в формате "0" и "1", без пробелов и запятых')

message = [i for i in (map(int, message))]
orig_message = ''.join(map(str, message))

#/==========================================================================/#
#/            Вычислим синдром для каждого контрольного бита                /#
#/==========================================================================/#

S1 = sum(message[::2])%2
S2 = sum([message[1], message[2], message[5], message[6]])%2
S3 = sum(message[3:])%2
S = int(str(S3)+str(S2)+str(S1), 2) # Номер цифры в десятичной системе счисления, в которой допущена ошибка

#/==========================================================================/#
#/    В зависимости от обнаружения ошибки выводим одно из этих сообщений    /#
#/==========================================================================/#

if S == 0:
    message = ''.join(map(str, message))
    i = ''.join([message[2], message[4], message[5], message[6]])
    print(f"В коде {orig_message} нет ошибок. Исходное сообщение: {i}")
else:
    bits = ["r1", "r2", "i1", "r3", "i2", "i3", "i4"]
    message[S-1] = int(not(message[S-1]))
    message = ''.join(map(str, message))
    i = ''.join([message[2], message[4], message[5], message[6]])
    print(f"В коде {orig_message} есть ошибка в бите {bits[S-1]}. Исходное сообщение: {i}")